UT23dev.РасширениеТорговыйЗалИКасса/src/DataProcessors/РТЗ_РаботаТорговогоЗала/РТЗ_РаботаТорговогоЗала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РТЗ_РаботаТорговогоЗала</name>
</mdclass:DataProcessor>

UT23dev.РасширениеТорговыйЗалИКасса/src/Documents/РТЗ_РозничныйЗаказ/РТЗ_РозничныйЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РТЗ_РозничныйЗаказ</name>
  <comment>Розничный документ заказа товара</comment>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Корзина</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT23dev.РасширениеТорговыйЗалИКасса/src/DataProcessors/РТЗ_РаботаТорговогоЗала/Forms/Форма/Module.bsl
// @strict-types

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать()
//	Если Корзина.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВводаПароля", ЭтотОбъект);
	ОткрытьФорму("Обработка.РТЗ_РаботаТорговогоЗала.Форма.ВводПароля",,,,,,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПодборНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодборНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

//Вызывается в случае успешных проверок и нахождения менеджера
&НаСервере
Процедура СформироватьНаСервере()
	ДокументЗаказа = Документы.РТЗ_РозничныйЗаказ.СоздатьДокумент();
	ДокументЗаказа.Менеджер = Менеджер;
	ДокументЗаказа.Корзина.Загрузить(Корзина.Выгрузить());
	ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
КонецПроцедуры

// Обработка оповещения
// Параметры:
//  Результат - СправочникСсылка.Пользователи - Ссылка на менеджера
//	ДопПараметры - Неопределено - допольнительные параметры, обычно массив
&НаКлиенте
Процедура ПослеЗакрытияВводаПароля(Результат, ДопПараметры) Экспорт
	Если Не ЗначениеЗаполнено(Результат) Тогда
		//Пользователь не найден
		Возврат;
	КонецЕсли;
	
	Сообщить(Результат.ПолучитьОбъект().ПолноеНаименование(), СтатусСообщения.Важное);
	//СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти
